# おすすめライブラリ7選

# 1.　OpenPyXL
# ExcelファイルをPythonで操作できるライブラリ
# 特徴：Excelファイル読み込み、データ書き込み、新規作成
# 特徴：書式設定、罫線、ヘッダー
# 使い方：各社員ごとの出勤簿->月次の集計　　DB->書き込み->Excelファイル
# 自動化可能

# 2.　Pandas
# データを表形式で持つオブジェクト(DataFrame)を扱うライブラリ
# 行や列の一括処理が速い
# 特徴：列にカラム名、行にインデックスをつけられる、データが分かりやすくなる(多次元配列➺DataFrame)
# 特徴：条件で抽出、Nanを埋める
# データ分析に必須なライブラリ

# 3.  BeautifulSoup
# HTMLやXMLからデータを簡単に抽出できる(Webスクレイピングで利用)
# Pythonのライブラリ"request"はウェブサイトからHTMLデータを取得できるライブラリです
# 使い方：requestでHTMLデータを取得します->BeautifulSoupでBeautifulオブジェクトを作って、メソッドを使って簡単にデータを取得
# ウェブサイトの情報のデータを自動的に取得して使える

# 4.  python-crontab
# スケジュールを決めて、定期的にタスクを実行(cronのPython版)
# 指定されたコマンドはシェルコマンド(Pythonのコードではなくて、OSに対するコマンド)

# 5.  OpenCV
# 画像や動画を処理
# 特徴：画像のサイズを変更、モノクロにする、モザイクをかけるなど一般的な画像処理は一通りできる
# 特徴：画像の顔認識
# OpenCVは元々C++で書かれていて、Python用やJava用に加工され、幅広く使われています

# 6.　pytest
# Pythonコードをテストするライブラリ(コードのテスト)
# 自動化に欠かせないライブラリ、想定通り動くかを検証する
# QC：信頼性、セキュリティ、可用性

# 7.　PyAutoGui
# パソコン画面上での操作をPythonコードによって自動で行える(操作のテスト)
# 特徴；カーソル移動、クリック、キーボード入力
# 特徴：パソコンでの操作の多くを自動化できる
